<template>
    <div class="display-flex">
        <SideMenu v-if="isShow" />
        <main class="mypage__main" :class="{ noside_main: !isShow }">
            <section
                class="[ padding-top--24 padding-top-large--48 ] margin-bottom-large--48"
            >
                <div class="container">
                    <h2 class="text-center heading-primary">利用規約</h2>
                    <article
                        class="padding--16 bg-gray [ [ margin-left-medium--48 margin-left-large--24 ] [ margin-right-medium--48 margin-right-large--24 ] [ margin-bottom--48 margin-bottom-large--88 ] ]"
                    >
                        <div class="[ padding--24 padding-large--48 ] bg-white">
                            <h4 class="margin-bottom--24">約款</h4>
                            <div class="table-scrollable">
                                <p>
                                    <small>
                                        本約款には、当社とユーザーとの間の権利義務関係及び本サービスの提供条件並びに当社の免責事項等が定められていますので、本サービスの利用にあたり、全文をお読みいただいたうえで、これに同意いただく必要があります。
                                    </small>
                                </p>
                                <p style="margin-bottom: 0.5em">
                                    第１条（定義）
                                </p>
                                <p>
                                    <small>
                                        本約款において使用する次の用語は、次に定める意味を有するものとします。<br />
                                        ⑴　「当社」とは、株式会社マネーボードを意味します。<br />
                                        ⑵　「ユーザー」とは、第４条（登録）に基づいて本サービスの利用者としての登録がなされた法人又は個人事業者を意味します。<br />
                                        ⑶　「本サービス」とは、当社が提供するＭｏｎｅｙＢｏａｒｄという名称のサービス（サービスの名称又は内容が変更された場合、当該変更後のサービスを含みます。）を意味します。<br />
                                        ⑷　「サービス利用契約」とは、本約款を契約条件として当社とユーザーとの間で締結される本サービスの利用契約を意味します。<br />
                                    </small>
                                </p>
                                <p style="margin-bottom: 0.5em">
                                    第２条（適用）
                                </p>
                                <p>
                                    <small>
                                        １　本約款は、本サービスの提供条件及び本サービスの利用に関する当社とユーザーとの間の権利義務関係を定めることを目的とし、ユーザーと当社との間の一切の関係に適用されます。<br />
                                        ２　当社が当社ウェブサイト上で掲載する本サービス利用に関する規約は、本約款の一部を構成するものとします。<br />
                                        ３　本約款の内容と前項の規約その他の本約款外における本サービスの説明等とが異なる場合、本約款の規定が優先して適用されます。<br />
                                    </small>
                                </p>
                                <p style="margin-bottom: 0.5em">
                                    第３条（許諾）
                                </p>
                                <p>
                                    <small>
                                        １　当社は、ユーザーに対し、ユーザーが本約款を遵守する限り、本サービスに関する当社が開発したソフトウェア（以下「本ソフトウェア」といいます。）をライセンス数に応じて使用端末にインストールし、使用する権利を許諾します。<br />
                                        ２　前項により許諾される権利は、譲渡できず、再許諾されない非独占のものとします。<br />
                                        ３　当社は、ユーザーに対し、第１項により許諾された範囲を超える複製を許諾せず、公衆送信、貸与、翻案その他第１項の態様以外で利用することを許諾しません。<br />
                                        ４　ユーザーは、社内業務の遂行を目的として、本ソフトウェアを使用することができます。ユーザーは、本ソフトウェアを営利目的で第三者に使用させる等、社内業務の遂行以外の目的に本ソフトウェアを使用し、又は第三者に使用させてはなりません。<br />
                                    </small>
                                </p>
                                <p style="margin-bottom: 0.5em">
                                    第４条（登録）
                                </p>
                                <p>
                                    <small>
                                        １　本サービスの利用を希望する者（以下「登録希望者」といいます。）は、本約款を遵守することを誓約し、かつ、当社の定める一定の情報（以下「登録事項」といいます。）を当社の定める方法で当社に提供することにより、本サービスの利用の登録を申請することができます。<br />
                                        ２　当社は、当社の基準に従って、前項の登録の可否を判断し、当社が登録を認めた場合、その旨を登録希望者に通知します。登録希望者のユーザーとしての登録は、当社が本項の通知を行ったことをもって完了したものとします。<br />
                                        ３　前項に定める登録の完了時に、サービス利用契約がユーザーと当社との間に成立したものとします。<br />
                                        ４　当社は、登録希望者が、次の各号のいずれかの事由に該当する場合、登録を拒否することができ、その理由を開示する義務を負いません。<br />
                                        ⑴　当社に提供した登録事項の全部又は一部に虚偽、誤記又は記載漏れがあった場合<br />
                                        ⑵　未成年者、成年被後見人、被保佐人又は被補助人のいずれかであり、法定代理人、後見人、保佐人又は補助人の同意等を得ていなかった場合<br />
                                        ⑶　反社会的勢力等（暴力団、暴力団員、右翼団体、反社会的勢力、その他これに準ずる者を意味します。以下同じ。）である又は資金提供その他を通じて反社会的勢力等の維持、運営若しくは経営に協力若しくは関与する等反社会的勢力等との何らかの交流若しくは関与を行っていると当社が判断した場合<br />
                                        ⑷　過去に当社との間の契約に違反した者又はその関係者であると当社が判断した場合<br />
                                        ⑸　過去に第８条（解除）の措置を受けたことがある場合<br />
                                        ⑹　その他、登録が適当でないと当社が判断した場合<br />
                                        ５　ユーザーは、登録事項に変更があった場合、当社の定める方法により当該変更事項を遅滞なく当社に通知しなければなりません。<br />
                                    </small>
                                </p>
                                <p style="margin-bottom: 0.5em">
                                    第５条（ユーザーＩＤの管理等）
                                </p>
                                <p>
                                    <small>
                                        １　当社は、前条の登録の後、ユーザーに対し、本サービスに関するユーザーＩＤ及びパスワードを発行します。<br />
                                        ２　ユーザーは、その責任において、本サービスに関するユーザーＩＤ及びパスワードを適切に管理しなければならず、これらを第三者に開示し、又は、第三者に貸与若しくは譲渡してはなりません。<br />
                                        ３　ユーザーは、第三者によるユーザーＩＤの不正使用その他の事故が発生し、又はその発生のおそれがある場合、当社に対し、直ちに通知し、当社の指示を仰ぐものとします。<br />
                                        ４　当社は、ユーザーによるユーザーＩＤ又はパスワードの管理の不備、使用上の過誤、第三者による使用（第三者によるユーザーＩＤの不正使用その他の事故を含みます。）によってユーザーに生じた損害につき、責任を負担しません。<br />
                                        ５　ユーザーは、その従業員に対して本サービスに関するユーザーＩＤ及びパスワードを付与する場合、ユーザーは、当該従業員に対し、本約款を周知させるとともに本約款に定めるユーザーの義務を遵守させなければなりません。<br />
                                    </small>
                                </p>
                                <p style="margin-bottom: 0.5em">
                                    第６条（料金及び支払方法）
                                </p>
                                <p>
                                    <small>
                                        １　ユーザーは、本サービス利用の対価として、所定の利用料金を、当社が指定する支払方法により当社に支払うものとします。<br />
                                        ２　当社は、事由の如何を問わず、ユーザーが支払った前項の利用料金を返還する義務を負いません。<br />
                                        ３　サービス利用契約が終了した場合、ユーザーは、その終了した日の属する月の利用料金の全額を支払うものとします。<br />
                                        ４　ユーザーが利用料金の支払を遅滞した場合、ユーザーは、年１４．６％の割合による遅延損害金を当社に支払うものとします。<br />
                                    </small>
                                </p>
                                <p style="margin-bottom: 0.5em">
                                    第７条（禁止事項）
                                </p>
                                <p>
                                    <small>
                                        ユーザーは、本サービスの利用にあたり、次の各号のいずれかに該当する行為又は該当すると当社が判断する行為をしてはなりません。<br />
                                        ⑴　法令に違反する行為又は犯罪行為に関連する行為<br />
                                        ⑵　公序良俗に反する行為<br />
                                        ⑶　当社又は第三者のプライバシーの権利、名誉、その他の権利又は利益を侵害する行為<br />
                                        ⑷　本サービスのネットワーク又は通信設備等に過度の負荷をかける行為<br />
                                        ⑸　当社が提供するソフトウェアの一部又は全部を複製、改変又は翻案する行為<br />
                                        ⑹　当社が提供するソフトウェアの解析行為、又は、同ソフトウェアのソースコードを得る行為<br />
                                        ⑺　当社が提供するソフトウェアの全部若しくは一部を他のソフトウェアに組み込み、又は、他のソフトウェアの全部若しくは一部を当社が提供するソフトウェアに組み込む行為<br />
                                        ⑻　本サービスの運営を妨害するおそれのある行為<br />
                                        ⑼　当社のネットワーク又は通信設備等に不正にアクセスする行為<br />
                                        ⑽　第三者に成りすます行為<br />
                                        ⑾　本サービスの他のユーザーのユーザーＩＤ又はパスワードを利用する行為<br />
                                        ⑿　本サービスの他のユーザーに関する情報を収集する行為<br />
                                        ⒀　前各号の行為を直接又は間接に惹起し、又は容易にする行為<br />
                                        ⒁　前各号の行為を試みる行為<br />
                                        ⒂　その他、当社が不適切と判断する行為<br />
                                    </small>
                                </p>
                                <p style="margin-bottom: 0.5em">
                                    第８条（解除）
                                </p>
                                <p>
                                    <small>
                                        １　当社は、ユーザーが、以下の各号のいずれかの事由に該当する場合、何らの催告なくしてサービス利用契約を解除することができます。<br />
                                        ⑴　差押、仮差押、仮処分、滞納処分、その他公権力の処分を受け、又は破産手続開始、民事再生手続開始、会社更生手続開始、特別清算開始若しくはこれらに類する手続の申立てがあった場合<br />
                                        ⑵　自ら振り出し若しくは引き受けた手形が不渡りになる等の支払停止状態に至った場合<br />
                                        ⑶　死亡又は後見開始、保佐開始若しくは補助開始の申立てがあった場合<br />
                                        ⑷　解散、清算、事業の全部又は重要な一部を第三者に譲渡しようとした場合<br />
                                        ⑸　監督官庁から営業停止、営業免許若しくは営業登録の取消しの処分を受けた場合<br />
                                        ⑹　本約款のいずれかの条項に違反した場合<br />
                                        ⑺　第４条（登録）第４項各号に該当する事由があったことが判明した場合<br />
                                        ⑻　６か月以上本サービスの利用がない場合<br />
                                        ⑼　当社からの通知に対して３０日を経過しても応答がない場合<br />
                                        ⑽　その他、当社が本サービスの利用の継続を適当でないと判断した場合<br />
                                        ２　前項による解除の場合、当社は、ユーザーに対し、損害賠償を請求することができます。また、ユーザーは、当然に期限の利益を失い、直ちに当社に対する債務を支払わなければなりません。<br />
                                        ３　当社は、第１項の解除により、ユーザーに生じた損害につき、責任を負担しません。<br />
                                    </small>
                                </p>
                                <p style="margin-bottom: 0.5em">
                                    第９条（本サービスの停止又は中断）
                                </p>
                                <p>
                                    <small>
                                        １　当社は、次の各号のいずれかに該当する場合、ユーザーに事前に通知することなく、本サービスの全部又は一部の提供を停止又は中断することができるものとします。<br />
                                        ⑴　本サービスに係る通信設備、通信回線、ソフトウェア等の保守、点検を行う場合<br />
                                        ⑵　地震、落雷、火災、風水害、停電、天災地変などの不可抗力により本サービスの運営ができなくなった場合<br />
                                        ⑶　通信設備、通信回線等の障害、誤操作、過度なアクセスの集中、不正アクセス、ハッキング等により本サービスの運営ができなくなった場合<br />
                                        ⑷　法令に基づく措置により、本サービスの運営ができなくなった場合<br />
                                        ⑸　その他、当社が停止又は中断を必要と判断した場合<br />
                                        ２　当社は、前項の停止又は中断によりユーザーに生じた損害につき、責任を負担しません。<br />
                                    </small>
                                </p>
                                <p style="margin-bottom: 0.5em">
                                    第１０条（解約）
                                </p>
                                <p>
                                    <small>
                                        １　ユーザーは、当社の定める方法により、サービス利用契約を解約してユーザーとしての登録を抹消することができます。<br />
                                        ２　前項の解約にあたり、当社に対する債務が有る場合、ユーザーは、当然に期限の利益を失い、直ちに当社に対する債務を支払わなければなりません。<br />
                                    </small>
                                </p>
                                <p style="margin-bottom: 0.5em">
                                    第１１条（本サービスの終了等）
                                </p>
                                <p>
                                    <small>
                                        １　当社は、その都合により、本サービスの内容を変更し、又は提供を終了することができます。<br />
                                        ２　当社が本サービスの提供を終了する場合、当社は、ユーザーに事前に通知するものとします。<br />
                                        ３　当社は、第１項の変更又は終了によりユーザーに生じた損害につき、責任を負担しません。<br />
                                    </small>
                                </p>
                                <p style="margin-bottom: 0.5em">
                                    第１２条（契約終了時の措置）
                                </p>
                                <p>
                                    <small>
                                        事由の如何を問わず、サービス利用契約が終了した場合、ユーザーは、その責任と費用によって、本ソフトウェアを使用端末から消去するとともに、その使用を中止しなければなりません。
                                    </small>
                                </p>
                                <p style="margin-bottom: 0.5em">
                                    第１３条（免責等）
                                </p>
                                <p>
                                    <small>
                                        １　当社は、ユーザーに対し、本サービスがユーザーの特定の目的に適合すること、期待する機能、商品的価値、正確性、完全性及び有用性を有すること、ユーザーによる本サービスの利用がユーザーに適用のある法令又は業界団体の内部規則等に適合すること、継続的に利用できること及び不具合が生じないことにつき、明示又は黙示を問わず、保証するものではありません。<br />
                                        ２　当社は、本サービスに関してユーザーに生じた損害につき、当社が賠償責任を負う場合であっても、過去1か月間にユーザーが当社に支払った利用料金の金額を超えて賠償する責任を負わないものとし、付随的損害、間接損害、特別損害、将来の損害及び逸失利益にかかる損害についても、賠償する責任を負わないものとします。<br />
                                        ３　当社は、事由の如何を問わず、サービス利用契約が終了した場合、又は、本サービスの全部若しくは一部の提供を終了した場合、ユーザーの同意を得ることなく、本サービスに関連するデータ（ユーザーが当社管理の通信設備に送信することで同通信設備にて保存されているものを含む。）の全部又は一部を直ちに消去できるものとし、これによりユーザーに生じた損害につき、責任を負担しないものとします。<br />
                                        ４　本サービスに関連してユーザーと第三者（他のユーザーを含む。）との間に紛争が生じた場合、ユーザーがその責任と費用によってこれを解決するものとし、当該紛争に関連して当社に損害が生じた場合、ユーザーは、当社に対し、直ちに損害を賠償するものとします。<br />
                                    </small>
                                </p>
                                <p style="margin-bottom: 0.5em">
                                    第１４条（ユーザー情報の取扱い）
                                </p>
                                <p>
                                    <small>
                                        １　当社によるユーザーに関連する情報の取扱いについては、当社プライバシーポリシーの定めによるものとし、ユーザーは、これに同意するものとします。<br />
                                        ２　当社は、ユーザーが当社に提供した情報、データ、本サービス内で登録した第三者の情報等（「以下「提供情報」といいます。）を、個人を特定できない形での統計的な情報として、当社の裁量で、利用及び公開することができるものとし、ユーザーはこれに同意するものとします。<br />
                                        ３　当社は、あらかじめユーザーの同意を得ることなく、以下のとおり提供情報の共同利用を行います。<br />
                                        ⑴
                                        　管理に関する責任者　　　　　　　株式会社マネーボード<br />
                                        ⑵
                                        　共同して利用する者の利用目的　　ユーザーが利用中のサービスの新機能開発、新規サービスの開発その他関連する事項<br />
                                        ⑶　共同して利用する者の範囲　　　　当社企業グループを構成する企業及び業務提携先<br />
                                    </small>
                                </p>
                                <p style="margin-bottom: 0.5em">
                                    第１５条（秘密保持）
                                </p>
                                <p>
                                    <small>
                                        ユーザーは、本サービスに関連して当社がユーザーに対して秘密に取扱うことを求めて開示した非公知の情報について、当社の事前の書面による承諾がある場合を除き、秘密に取扱うものとします。
                                    </small>
                                </p>
                                <p style="margin-bottom: 0.5em">
                                    第１６条（通知）
                                </p>
                                <p>
                                    <small>
                                        １　本サービスに関する問い合わせその他ユーザーから当社に対する通知及び本約款の変更に関する通知その他当社からユーザーに対する通知は、当社の定める方法で行うものとします。<br />
                                        ２　当社が登録事項に含まれるユーザーのメールアドレスその他の連絡先に通知を行った場合、ユーザーに当該通知が到達したものとみなします。<br />
                                    </small>
                                </p>
                                <p style="margin-bottom: 0.5em">
                                    第１７条（サービス利用契約上の地位の譲渡等）
                                </p>
                                <p>
                                    <small>
                                        １　ユーザーは、当社の書面による事前の承諾なく、サービス利用契約上の地位又は本約款に基づく権利若しくは義務につき、第三者に対し、譲渡、移転、担保設定、その他の処分をすることはできません。<br />
                                        ２　当社は、本サービスにかかる事業を事業譲渡（事業が移転するあらゆる形態を含みます。）した場合、当該事業譲渡に伴いサービス利用契約上の地位、本約款に基づく権利及び義務並びにユーザーの登録事項その他の顧客情報を譲受人に譲渡することができるものとし、ユーザーは、当該譲渡につき、予め同意したものとします。<br />
                                    </small>
                                </p>
                                <p style="margin-bottom: 0.5em">
                                    第１８条（協議）
                                </p>
                                <p>
                                    <small>
                                        本約款に定めがない事項が生じた場合又は本約款の解釈に関して疑義が生じた場合、当社とユーザーは、誠意をもって協議してこれを解決するものとします。
                                    </small>
                                </p>
                                <p style="margin-bottom: 0.5em">
                                    第１９条（準拠法及び管轄裁判所）
                                </p>
                                <p>
                                    <small>
                                        １　本約款及びサービス利用契約の準拠法は、日本法とします。<br />
                                        ２　本約款又はサービス利用契約に起因若しくは関連する一切の紛争については、大阪地方裁判所を第一審の専属的合意管轄裁判所とします。<br />
                                    </small>
                                </p>
                                <p style="margin-bottom: 0.5em">
                                    第２０条（本約款等の変更）
                                </p>
                                <p>
                                    <small>
                                        当社は、当社が必要と認めた場合、本約款を変更できるものとし、変更後の本約款の内容及び施行時期を当社ウェブサイト上での掲示その他の適切な方法により周知し、又はユーザーに通知します。但し、法令上ユーザーの同意が必要となるような内容の変更の場合、当社の定める方法により、ユーザーの同意を得るものとします。
                                    </small>
                                </p>
                                <p style="margin-bottom: 0.5em">
                                    第２１条（存続条項）
                                </p>
                                <p>
                                    <small>
                                        事由の如何を問わず、サービス利用契約が終了した後においても、第７条（禁止事項）、第１３条（免責等）、第１５条（秘密保持）、第１６条（通知）第２項及び第１９条（準拠法及び管轄裁判所）の規定は、有効に存続するものとします。
                                    </small>
                                </p>
                                <p>
                                    <small> ２０２４年１月９日制定 </small>
                                </p>
                            </div>
                        </div>
                    </article>
                </div>
            </section>
        </main>
    </div>
</template>

<script>
import SideMenu from "../../components/SideMenuComponent.vue";

export default {
    components: {
        SideMenu,
    },
    data() {
        return {
            isShow: false,
        };
    },
    computed: {
        getCompany() {
            return this.$store.getters["auth/company"];
        },
    },
    methods: {
        clearAuthToken() {
            localStorage.removeItem("authToken");
        },
    },
    created() {
        if (localStorage.getItem("authToken") && this.getCompany === null) {
            this.clearAuthToken();
        }

        // trueにしたりfalseにしたり
        this.isShow = localStorage.getItem("authToken");
    },
    mounted: function () {
        document.title = "利用規約 | MoneyBoard";
    },
};
</script>

<style lang="scss" scoped>
@import "resources/sass/abstracts/_variables.scss";
@import "resources/sass/vendors/_media.scss";
@import "resources/sass/pages/_mypage.scss";
</style>
