export default [
    {
        id: 1,
        question: "ログインするにはなにが必要ですか？",
        answer: "会社ごとに割り当てられた企業コードと管理者が設定したパスワードを入力してください。\n企業コードとパスワードが不明な場合は、社内の管理者の方へご確認ください。\nまた、【操作ガイド動画】＞基本操作 からも手順はご確認いただけますので\nぜひ、ご覧ください",
    },
    {
        id: 2,
        question: "パスワードを忘れた場合はどうすればいいですか？",
        answer: "社内の管理者の方へお問い合わせください。管理者がマイページからパスワードの再設定を行うことができます。",
    },
    {
        id: 3,
        question: "データの保存方法を教えてください",
        answer: "財務データを保存するかは顧客に選択してもらいます。試してみたいがデータを保存されたくない方にも対応しています。",
    },
];
