<template>
    <main>
        <section class="[ padding-top--24 padding-top-large--48 ] margin-bottom-large--48">
            <div class="container">
                <h2 class="text-center  heading-primary">新規登録</h2>
                <form @submit.prevent="signup" class="vld-parent">
                    <loading v-model:active="loadingStatus"
                            :can-cancel="false"
                            :is-full-page="false"
                            :color="'#2FBCED'"
                            :height="90"
                            :width="100" />
                    <article class="padding--16  bg-gray  [ margin-left-medium--48  margin-right-medium--48  margin-large--0 ]">
                        <div class="padding--24  bg-white">
                            <h4 class="margin-bottom--24">利用規約</h4>
                            <div class="table-scrollable  padding-right--8">
                                <small>
                                    本規約は、全ての会員に適用され、登録手続時および登録後にお守りいただく規約です。<br>
                                    <b>第1条(会員等)</b><br>
                                    1. 「会員」とは、株式会社PPFパートナーズ(以下「当社」といいます)が定める手続に従い本規約に同意の上、当社の提供するプラットフォーム「gooit」(以下「本サービス」といいます)へ入会の申し込みを行い、当社との間で 本サービスの利用に関する契約(以下、「利用契約」という。)が成立した個人のユーザーをいいます。 2. 「会員情報」とは、会員が当社に開示した会員の属性に関する情報および会員の取引に関する履歴等の情報をいいます。<br>
                                    3. 「メンター」とは、会員であり、本サービスを利用してレッスンを提供する先生をいいます。<br>
                                    4. 「メンティー」とは、会員であり、本サービスを利用してレッスンを受講する生徒をいいます。 <br>
                                    5. 「レッスン金額」は、メンターが設定したレッスンの対価をいいます。<br>
                                    <br>
                                    <b>第2条(登録)</b><br>
                                    1. 会員登録<br>
                                    (1) 本規約に同意の上、所定の入会申込みをされたユーザーは、当初所定の審査・登録手続完了後に会員資格を取得<br>
                                    します。また、この時に会員・当社間の利用契約が成立します。<br>
                                    (2) 会員登録手続は、会員となるご本人が行ってください。代理による登録は一切認められません。 <br>
                                    (3) 当社は、過去に会員資格が取り消された方その他当社が相応しくないと判断した方からの会員申込をお断りする<br>
                                    場合があります。<br>
                                    2. 会員情報の入力 会員登録手続の際には、入力上の注意書をよく読み、所定の入力フォームに必要事項を正確に入力してください。<br>
                                    (1) お客様は、会員情報の登録において、特殊記号・旧漢字・ローマ数字などはご使用になれません。これらの文字が登録された場合は当社にて変更致します。<br>
                                    (2) お客様は、自身の正しい個人情報のみを登録できるものとします。登録情報の一部又は全部を問わず、虚偽の情<br>
                                    報、第三者の情報、存在しない情報等は、一切登録してはならないものとします。<br>
                                    3.ID・パスワードの管理 <br>
                                    (1) 登録されたID・パスワード(以下「アカウント」といいます)は会員本人のみが利用できるものとし、第三者に開<br>
                                    示・譲渡・貸与できないものとします。<br>
                                    (2) アカウントは、他人に知られることがないよう定期的に変更する等、会員本人が責任をもって管理してください。<br>
                                    (3) 当社は、アカウントを用いて当社に対して行われた意思表示を、会員本人の意思表示とみなします。そのために<br>
                                    生じる支払等は全て会員の責任となります。<br>
                                    (4) アカウントの管理不十分、使用上の過誤、第三者の使用等による損害の責任は会員が負うものとし、会員の故意または過失の有無を問わず、当社は一切の責任を負いません。 <br>
                                    (5) 会員は、アカウントが盗まれたり、第三者に使用されていることが判明した場合には、直ちにその旨を当社に通<br>
                                    知するとともに、当社からの指示に従うものとします。<br>
                                    4. 会員は、氏名、住所など当社に届け出た事項に変更があった場合には、速やかに変更登録又は当社に連絡するものとします。<br>
                                    5. 変更登録がなされなかったことにより生じた損害について、当社は一切責任を負いません。また、変更登録がなされ た場合でも、変更登録前にすでに手続がなされた取引は、変更登録前の情報に基づいて行われます。<br>
                                    <br>
                                    <b>第3条(退会)</b><br>
                                    1. 会員が退会を希望する場合には、会員本人が退会手続を行ってください。当社による所定の退会手続の完了後に、退会となります。 <br>
                                    2. 退会申請時に、レッスンの予約がある場合は退会できません。予約のあるレッスン終了に退会が可能となります。<br>
                                    <br>
                                    <b>第4条(会員情報の取扱い)</b><br>
                                    1. 当社は、原則として会員情報を会員の事前の同意なく第三者に対して開示することはありません。ただし、次の各号の場合には、会員の事前の同意なく、当社は会員情報その他の顧客情報を開示できるものとします。<br>
                                    (1) 法令に基づき開示を求められた場合<br>
                                    (2) 当社の権利、利益、名誉等を保護するために必要であると当社が判断した場合 2. 当社は、当社の「個人情報保護方針」に従い、会員情報を取り扱います。当社は、会員情報を、会員へのサービス提<br>
                                    供、サービス内容の向上、サービスの利用促進、 およびサービスの健全かつ円滑な運営の確保を図る目的のために、 当社において利用することができるものとします。 <br>
                                    3. 当社は、会員に対して、メールマガジンその他の方法による情報提供(広告を含みます)を行うことができるものとし ます。会員が情報提供を希望しない場合、会員が当社に対し、当社所定の方法に従い、通知して頂くことにより、情 報提供を停止できます。ただし、本サービス運営に必要な情報提供につきましては、会員の希望により停止することはできません。<br>
                                    <br>
                                    <b>第5条(利用料等)</b><br>
                                    1. 会員は、本サービスの内、会員登録、レッスン登録、メンター検索、レッスン検索及び記事作成を無料でご利用頂けます。 <br>
                                    2. メンティーは、当社に対し、レッスン予約時にレッスン金額を支払います。 <br>
                                    3. メンターは、当社に対し、レッスン金額(税込)のうち20%を利用手数料として支払います。 <br>
                                    4. 当社は、メンターに対し、レッスン終了後7日以内に、第2項に基づきメンティーから受け取ったレッスン金額から * 前項の利用手数料、及び、振込手数料200円(税込)を控除した額を支払います。 <br>
                                    5. レッスン金額及び利用手数料の支払方法は当社が指定します。ただし、この支払方法に海外送金は含みません。会員への振込先は国内口座に限られます。 <br>
                                    6. メンティーがレッスンの予約をしたにも関わらず、メンターがレッスンを行わず、かつ、メンター・メンティーの合 意による振り替えの予定が立っていない場合、メンティーは当社に対し、レッスン予定日から7日以内に、返金を求 めることができます。当社は、レッスンが行われなかったこと及び振り替えの予定がない事を確認次第、メンティー の指定口座に対して返金の手続を取ります。当社は、この期限を過ぎた返金請求に対しては、理由の如何を問わず一 切応じかねます。<br>
                                    <br>
                                    <b>第6条(遵守・禁止事項)</b><br>
                                    1. 本サービスの利用に際して、会員は次の各号の事項を遵守しなければなりません。 <br>
                                    (1) 予約したレッスンの時間を厳守する。 <br>
                                    (2) やむをえない事情がある場合、事前に、速やかに予約したレッスンのリスケジュールまたはキャンセルをする。 (3) マナーを守り、礼儀を尽くす。 <br>
                                    (4) お互いのプライバシーを尊重する。 <br>
                                    (5) 正しい礼儀の上、言葉遣いを意識する。 <br>
                                    (6) メンターは社会通念上妥当なレッスン金額を設定する。 <br>
                                    2. 本サービスの利用に際して、会員は次の各号の行為を行ってはなりません。<br>
                                    (1) 当社、およびその他の第三者の権利、利益、名誉等を損ねること。 <br>
                                    (2) 青少年の心身に悪影響を及ぼす恐れがある行為、その他公序良俗に反する行為を行うこと。 <br>
                                    (3) 他の会員その他の第三者に迷惑となる行為や不快感を抱かせる行為を行うこと。 <br>
                                    (4) 個人情報(本名、住所、電話番号など)を公開すること、又は公開の場で他人の個人情報に関して質問すること。<br>
                                    (5)本サービス以外の商品・サービスの宣伝誘致をすること。<br>
                                    (6) 本サービスに関わるレッスンの売買すること。 <br>
                                    (7) 虚偽・架空の情報を入力・登録すること。 <br>
                                    (8) 有害なコンピュータープログラム、メール等を送信または書き込むこと。 <br>
                                    (9) 当社のコンピューター、サーバーその他の機器に不正にアクセスすること。 <br>
                                    (10) アカウント、パスワードを第三者に貸与・譲渡、名義変更、売買すること、または第三者と共用すること。 (11) 他人の掲載内容を盗用しまたは不適切な利用をすること。 <br>
                                    (12) 法令または本規約に違反する行為をすること。 <br>
                                    (13) 本サービスの発展・維持のために当社が必要と判断してなされた警告にもかかわらず、これに反する行為を続けること。 <br>
                                    (14) その他、前各号に準じる行為をすること。<br>
                                    <br>
                                    <b>第7条(違反行為について)</b><br>
                                    当社は、前条2条に該当する行為を発見した場合、当サイト情報の掲載削除、アカウントの停止、登録されたレッスンの削除及びレ ッスン金額の返金その他の必要な措置を採ることができるものとします。<br>
                                    <br>
                                    <b>第8条(会員の責務及び紛争について)</b><br>
                                    1. 会員の責務 <br>
                                    (1) 会員が本サービスを利用するために必要となるコンピューター等の設備については、会員が自ら準備し、会員の<br>
                                    費用と責任において維持するものとし、これを怠ったことによって会員に 発生した不利益について、当社は一切<br>
                                    その責を負わないものとします。 <br>
                                    (2) 会員が本サービスを使用して、自らの行為により第三者に損害を与えた場合、会員は自己の責任と費用をもって<br>
                                    解決するものとし、当社に損害が及ばないように対処する義務を負います。<br>
                                    (3) 会員は、本規約に違反することにより、または本サービスの利用に関連して当社に損害を与えた場合、当社に対<br>
                                    しその損害を賠償しなければなりません。 <br>
                                    (4) 会員が、本サービスに関連して他の会員その他の第三者からクレームを受けまたはそれらの者との間で紛争を生<br>
                                    じた場合、まず会員双方が互いに信義誠実の原則に従って協議の上、速やかに解決を図るものとします。また、会員は紛争に関わる証拠の保全に努めるものとします。<br>
                                    (5)上記(4) の場合、会員は紛争の発生、経緯及び結果を、当社に対して、当社の求めに応じて報告する義務を負い<br>
                                    ます。<br>
                                    <b>第9条(知的財産権の扱い)</b><br>
                                    1. 当社は、人々のIT知識の交流及び向上を目標として本サービスを運営し、当サイト内のコンテンツ(掲載されたカリキュラム、教材、発明などの知的財産)を知的財産権として尊重し、可能な限り保護します。<br>
                                    2. 会員が通常の教育活動に基づいて創作した著作物(カリキュラム、教材等)に関する権利は会員に帰属するものとし<br>
                                    ます。 <br>
                                    3. 会員は適用ある著作権法及びその他の法令遵守することに同意し、当サイトの利用に際し、知的財産権の権利者からの書面による事前許可なく、商業目的又は公共の目的で、修正、コピー、配布、送信、表示、発行、販売、使用、作 成またはその他の使用を行うことはできません。<br>
                                    <br>
                                    <b>第10条(サービスの中断・停止等)</b><br>
                                    1. 当社は、本サービスの稼動状態を良好に保つために、次の各号の一に該当する場合、予告なしに、本サービスの提供 全てあるいは一部を停止することができます。 <br>
                                    (1) 当社のコンピューター、サーバー、ソフトウェア等について、保守点検、修理、補修、改良等を行う必要がある場合。<br>
                                    (2) コンピューター、サーバー、通信回線等の事故・障害が生じた場合。 <br>
                                    (3) 当社、会員、その他の第三者の利益を保護するため、当社においてサービスを一時停止することがやむを得ないと判断した場合。 <br>
                                    (4) その他、当社がサービスの一時停止を必要とした場合。 <br>
                                    2. 会員は、前項に基づき、本サービスが一時停止される場合があることをあらかじめ承諾し、本サービスの一時停止に より会員に何らかの損害・費用負担が生じたとしても、当社に故意又は重大な過失がある場合を除き、当社に対して補償等を請求しないものとします。<br>
                                    <br>
                                    <b>第11条(サービスの変更・廃止)</b><br>
                                    1. 当社は、業務上の都合等により、会員に対して提供している本サービスの全部又は一部を廃止することができます。 <br>
                                    2. 会員は、第1項に定める本サービスの全部又は一部の廃止により会員に何らかの損害又は費用負担が生じたとして も、当社に故意又は重大な過失がある場合を除き、当社に対して補償等を請求しないものとします。<br>
                                    <br>
                                    <b>第12条(本サービスの利用拒絶)</b><br>
                                    当社は、会員が次の各号に掲げる事項のいずれかに該当する場合は、会員に対して本サービスの提供を拒絶することができます。<br>
                                    (1) 会員が実在しないとき。 <br>
                                    (2) 会員が本規約のいずれかの規定に違反したとき。 <br>
                                    (3) 会員が、過去に本規約の違反等により、本サービスの利用を拒絶されたことがあるとき。<br>
                                    (4) 会員が制限行為能力者であって、本サービス利用の際に法定代理人、保佐人又は補助人の同意等を得ていないとき。<br>
                                    (5) 会員について、第15条に定める表明・保証に反する内容が判明したとき。 <br>
                                    (6) その他、会員に対する本サービスの提供が相当でないと当社が判断したとき。<br>
                                    <b>第13条(会員資格の喪失及び賠償義務)</b><br>
                                    1. 会員に代金支払の滞納、本規約への違反その他の債務不履行が発生した場合、当社は、利用契約を解除し、会員資格を取り消すことができます。<br>
                                    2.会員が以下の各号に定める行為をしたときは、会員は当社に対し、これにより当社が被った損害を賠償する責任を負います。<br>
                                    (1) ID、パスワードを不正に使用すること。 <br>
                                    (2) 当社のコンピューター、本サービスに係る情報を扱うサーバー等に不正にアクセスすること。 <br>
                                    (3) 当社のコンピューター、本サービスに係る情報を扱うサーバー等に有害なコンピュータープログラムを送信する<br>
                                    などすること。 <br>
                                    (4) 本サービスの営業を妨害すること。 <br>
                                    (5) 当社や他人の権利(所有権等の一般的な財産権のほか、著作権、商標権、意匠権、特許権等の知的財産権、名<br>
                                    誉・プライバシー等の人格権も含む。以下同じ。)を侵害する行為又はそのおそれのある行為すること。 <br>
                                    (6) その他、この利用規約に反する行為又はそのおそれのある行為をすること。<br>
                                    <br>
                                    <b>第14条(免責)</b><br>
                                    1. 通信回線やコンピューターなどの障害によるシステムの中断・遅滞・中止・データの消失、データへの不正アクセス<br>
                                    により会員に生じた損害について、 当社は、当社に故意又は重大な過失がある場合を除き、一切責任を負わないもの とします。 <br>
                                    2. 当社は、本サービスの利用に関連して会員に損害が発生した場合は、会員が被った直接の通常損害に限り、かつ金2 万円の範囲内においてのみ賠償するものとします。ただし、当該損害が当社の故意又は重大な過失に基づき発生した ものである場合はこの限りではありません。 <br>
                                    3. 当社は、当社のウェブページ・サーバー・ドメインなどから送られるメール・コンテンツに、コンピューター・ウィルスなどの有害なものが含まれていないことを保証いたしません。 <br>
                                    4. 当社は、本サービスにおいて会員が作成したデータの保存を保証いたしません。会員にて適宜バックアップ等の措置を取られるようにお願いいたします。 <br>
                                    5. 当社は、会員に対して本サービスを提供するにあたり、会員の所期する目的への本サービスの適合性及び本サービスの信頼性、正確性、適法性、性能について、何ら保証しません。 <br>
                                    6. 会員が本規約等に違反したことによって生じた損害については、当社は一切責任を負いません。<br>
                                    <br>
                                    <b>第15条(反社会的勢力の排除)</b><br>
                                    会員は当社に対し、次の各号に掲げる内容を表明し、保証する。 <br>
                                    (1) 会員が、現在及び将来にわたって、暴力団、暴力団関係企業、総会屋若しくはこれらに準じる者又はその構成員<br>
                                    その他の反社会的勢力に該当せず、また反社会的勢力と社会的に非難されるべき関係を持たないこと。<br>
                                    (2) 自ら又は第三者を利用して、現在及び将来にわたって、次の行為をしないこと。 <br>
                                    ア、暴力的な要求行為 <br>
                                    イ、法的な責任を超えた不当な要求行為<br>
                                    ウ、取引に関して脅迫的な言動をし、又は暴力を用いる行為 <br>
                                    エ、風説を流布し、偽計を用い、又は威力を用いて、当社の信用を毀損し、又は当社の業務を妨害する行為<br>
                                    オ、その他、アないしエに準ずる行為 <br>
                                    (3) 反社会的勢力に自己の名義を利用させ、利用契約の締結をするものではないこと。<br>
                                    <br>
                                    <b>第16条(通知方法)</b><br>
                                    1. 本規約に基づき、又は関連して当社から会員に対してなされる通知は、本規約又は利用契約に別段の定めがある場合 を除き、当社のウェブサイト上に掲載する方法で行うものとし、その掲載時をもって当社からの通知が完了したもの とみなします。<br>
                                    前項の規定にかかわらず、当社が適当と判断した場合には、前項の通知は、会員が利用時に入力した会員のメールア<br>
                                    ドレスに電子メールを送信する方法その他の方法で行うものとし、この場合は、当社が当該通知を発した時点で通知が完了したものとみなします。<br>
                                    <br>
                                    <b>第17条(本規約の改定)</b><br>
                                    当社は、本規約の変更が会員の一般の利益に適合する場合、又は本規約の変更が、契約をした目的に反せず、かつ、変更の必要性、 変更後の内容の相当性、変更に係る事情に照らして合理的なものである場合には、効力発生時期を定め、かつ、本規約を変更する旨 及び変更後の本規約の内容並びにその効力発生時期をインターネットの利用その他の適切な方法により会員に周知することで、本規 約を変更することができ、かかる変更により、会員が本規約の変更に同意したものとみなして変更後の本規約を適用します。<br>
                                    <br>
                                    <b>第18条(準拠法、管轄裁判所)</b><br>
                                    本規約及び利用契約の準拠法は、日本法とします。 2. 本規約に関して紛争が生じた場合、大阪地方裁判所を第一審の専属的合意管轄裁判所とします。<br>
                                    <br>
                                    <b>2021年6月16日 制定</b><br>
                                </small>
                            </div>
                            <hr>
                            <div class="text-center  margin-bottom--48">
                                <input
                                    type="checkbox"
                                    id="confirm-checkbox"
                                    class="form-checkbox"
                                    v-model="checkbox.terms_accepted"
                                    v-bind:class="{ 'form-error': v$.checkbox.terms_accepted.$error }">
                                <label class="form-checkbox-label  margin-bottom--8" for="confirm-checkbox">上記内容に同意します</label>
                                <div
                                    class="form-text  text-danger  margin-bottom--24"
                                    v-if="v$.checkbox.terms_accepted.$error">
                                    {{ v$.checkbox.terms_accepted.$errors[0].$message }}
                                </div>
                            </div>
                            <div class="form-two-lined">
                                <label
                                    for="email_address"
                                    class="form-label">
                                    <span class="[ icon  solid ] fa-envelope  padding-right--8  text-accent"></span>
                                    メールアドレス
                                </label>
                                <input
                                    type="email"
                                    id="email_address"
                                    class="form-input  margin-top--8"
                                    v-model="signupForm.email_address"
                                    @input="v$.signupForm.email_address.$touch"
                                    v-bind:class="[ v$.signupForm.email_address.$error ? 'form-error  margin-bottom--12' : 'margin-bottom--24']">
                                <div
                                    class="form-text  text-danger  margin-bottom--24"
                                    v-if="v$.signupForm.email_address.$error">
                                    {{ v$.signupForm.email_address.$errors[0].$message }}
                                </div>
                                <div
                                    class="form-text  text-danger  margin-bottom--24"
                                    v-if="signupErrors && signupErrors.email_address">
                                    <span v-for="msg in signupErrors.email_address" :key="msg">{{ msg }}</span>
                                </div>
                                <label
                                    for="email-confirmation"
                                    class="form-label">
                                    <span class="[ icon  solid ] fa-envelope  padding-right--8  text-accent"></span>
                                    メールアドレス　確認用
                                </label>
                                <input
                                    type="email"
                                    name="email_confirmation"
                                    id="email-confirmation"
                                    class="form-input  margin-top--8"
                                    v-model="signupForm.email_confirmation"
                                    @input="v$.signupForm.email_confirmation.$touch"
                                    v-bind:class="[ v$.signupForm.email_confirmation.$error ? 'form-error  margin-bottom--12' : 'margin-bottom--24']">
                                <div
                                    class="form-text  text-danger"
                                    v-if="v$.signupForm.email_confirmation.$error">
                                        {{ v$.signupForm.email_confirmation.$errors[0].$message }}
                                </div>
                            </div>
                        </div>
                    </article>
                    <div class="text-center  [ [ margin-top--48  margin-top-large--80 ]  [ margin-bottom--48  margin-bottom-large--140 ] ]">
                        <p class="text-danger">{{ signupErrors }}</p>
                        <button type="submit" class="[ btn  btn--accent ]" v-bind:disabled="checkbox.terms_accepted == false">登録</button>
                    </div>
                </form>
            </div>
        </section>
    </main>
</template>

<script>
import useVuelidate from '@vuelidate/core';
import Loading from 'vue-loading-overlay';
import 'vue-loading-overlay/dist/vue-loading.css';
import { required, maxLength, email, sameAs, helpers } from '@vuelidate/validators';
import { mapState, mapActions } from 'vuex';

export default {
    name: 'signup',
    components: {
        Loading
    },
    setup() {
        return { v$: useVuelidate() };
    },
    data () {
        return {
            checkbox: {
                terms_accepted: false,
            },
            signupForm: {
                email_address: '',
                email_confirmation: ''
            },
        }
    },
    validations() {
        return {
            checkbox: {
                terms_accepted: {
                    required:helpers.withMessage(
                        '上記内容に同意してください',
                        required
                    )
                }
            },
            signupForm: {
                email_address: {
                    required:helpers.withMessage(
                        'メールアドレスを入力してください',
                        required
                    ),
                    email:helpers.withMessage(
                        '正しい形を入力してください',
                        email
                    ),
                    maxLength: helpers.withMessage(
                        '255文字以内で入力してください',
                        maxLength(255)
                    ),
                },
                email_confirmation: {
                    required:helpers.withMessage(
                        '確認メールアドレスに再度入力してください',
                        required
                    ),
                    email:helpers.withMessage(
                        '正しい形を入力してください',
                        email
                    ),
                    sameAs:helpers.withMessage(
                        '確認メールアドレスがメールアドレスと違います',
                        sameAs(this.signupForm.email_address)
                    )
                },
            },
        }
    },
    computed: {
        ...mapState({
            apiStatus: state => state.auth.apiStatus,
            signupErrors: state => state.auth.signupErrorMessages,
            loadingStatus: state => state.auth.loadingStatus,
        })
    },
    methods: {
        ...mapActions('auth', ['sendEmailRegisterRequest']),
        signup () {
            this.v$.$touch();
            if (this.v$.$error) return;
            this.sendEmailRegisterRequest({ email_address: this.signupForm.email_address }).then(() => {
                if (this.apiStatus) {
                    this.$router.push(
                        {
                            name: 'signup-completion',
                            params: {
                                type: 'signup',
                                title: 'メール送信完了',
                                message: [
                                    'メールが送信されました。メールのURLから登録手続きをお願いします。',
                                ],
                                redirectPage: 'home'
                            }
                        }
                    )
                }
            });
        },
        clearError () {
            this.$store.commit('auth/setSignupErrorMessages', null)
        }
    },
    created () {
        this.clearError()
    },
    mounted: function(){
        document.title = "新規登録 | MoneyBoard"
    },
}
</script>
